&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)	
	// Получаем текущую строку табличной части
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	// Если товар не выбран - очищаем цену и сумму и выводим 0
	Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура) Тогда
		ТекущаяСтрока.Цена = 0;
		ТекущаяСтрока.Сумма = 0;
		Возврат;
	КонецЕсли; 
	
	// Получаем цену из регистра, вызовом серверной функции
	ТекущаяСтрока.Цена = ПолучитьЦенуИзРегистра(Объект.Дата, ТекущаяСтрока.Номенклатура); 
	
	// Если количество не заполнено (пустое) - устанавливаем 1
	Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.Количество) Тогда
		ТекущаяСтрока.Количество = 1;
	КонецЕсли;
	
	// Пересчитываем сумму (если цена вернулась 0 , сумма тоже будет 0)  
	ТекущаяСтрока.Сумма = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЦенуИзРегистра(Дата, Номенклатура)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) КАК Цена
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&Дата, Номенклатура = &Номенклатура) КАК ЦеныНоменклатурыСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();  
	Если РезультатЗапроса.Пустой() Тогда
		Возврат 0;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Цена;
	
КонецФункции 


&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
    // Получаем текущую строку табличной части	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;   
	
    // Пересчитываем сумму	
	ТекущаяСтрока.Сумма = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена; 	
КонецПроцедуры


&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)	
    // Получаем текущую строку табличной части	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;   
	
    // Пересчитываем сумму	
	ТекущаяСтрока.Сумма = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена; 	
КонецПроцедуры

