
Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр Резервы Приход
	Движения.Резервы.Записывать = Истина; 
	// очищаем черновик от старых движений
    Движения.Резервы.Очистить(); 
	
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.Резервы.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Склад = Склад;
		Движение.Количество = ТекСтрокаТовары.Количество;
	КонецЦикла; 
	
КонецПроцедуры
