
Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр ОстаткиТоваров Приход
	Движения.ОстаткиТоваров.Записывать = Истина; 
	// очищаем черновик от старых движений
    Движения.ОстаткиТоваров.Очистить();
	
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Склад = Склад;
		Движение.Количество = ТекСтрокаТовары.Количество;
	КонецЦикла;

КонецПроцедуры
